
default_city = "x";
cities_names = ["Азов", "Александров", "Алексин", "Альметьевск", "Анапа", "Ангарск", "Анжеро-Судженск", "Апатиты", "Арзамас", "Армавир", "Арсеньев", "Артем", "Архангельск", "Асбест", "Астрахань", "Ачинск", "Балаково", "Балахна", "Балашиха", "Балашов", "Барнаул", "Батайск", "Белгород", "Белебей", "Белово", "Белогорск (Амурская область)", "Белорецк", "Белореченск", "Бердск", "Березники", "Березовский (Свердловская область)", "Бийск", "Биробиджан", "Благовещенск (Амурская область)", "Бор", "Борисоглебск", "Боровичи", "Братск", "Брянск", "Бугульма", "Буденновск", "Бузулук", "Буйнакск", "Великие Луки", "Великий Новгород", "Верхняя Пышма", "Видное", "Владивосток", "Владикавказ", "Владимир", "Волгоград", "Волгодонск", "Волжск", "Волжский", "Вологда", "Вольск", "Воркута", "Воронеж", "Воскресенск", "Воткинск", "Всеволожск", "Выборг", "Выкса", "Вязьма", "Гатчина", "Геленджик", "Георгиевск", "Глазов", "Горно-Алтайск", "Грозный", "Губкин", "Гудермес", "Гуково", "Гусь-Хрустальный", "Дербент", "Дзержинск", "Димитровград", "Дмитров", "Долгопрудный", "Домодедово", "Донской", "Дубна", "Евпатория", "Егорьевск", "Ейск", "Екатеринбург", "Елабуга", "Елец", "Ессентуки", "Железногорск (Красноярский край)", "Железногорск (Курская область)", "Жигулевск", "Жуковский", "Заречный", "Зеленогорск", "Зеленодольск", "Златоуст", "Иваново", "Ивантеевка", "Ижевск", "Избербаш", "Иркутск", "Искитим", "Ишим", "Ишимбай", "Йошкар-Ола", "Казань", "Калининград", "Калуга", "Каменск-Уральский", "Каменск-Шахтинский", "Камышин", "Канск", "Каспийск", "Кемерово", "Керчь", "Кинешма", "Кириши", "Киров (Кировская область)", "Кирово-Чепецк", "Киселевск", "Кисловодск", "Клин", "Клинцы", "Ковров", "Когалым", "Коломна", "Комсомольск-на-Амуре", "Копейск", "Королев", "Кострома", "Котлас", "Красногорск", "Краснодар", "Краснокаменск", "Краснокамск", "Краснотурьинск", "Красноярск", "Кропоткин", "Крымск", "Кстово", "Кузнецк", "Кумертау", "Кунгур", "Курган", "Курск", "Кызыл", "Лабинск", "Лениногорск", "Ленинск-Кузнецкий", "Лесосибирск", "Липецк", "Лиски", "Лобня", "Лысьва", "Лыткарино", "Люберцы", "Магадан", "Магнитогорск", "Майкоп", "Махачкала", "Междуреченск", "Мелеуз", "Миасс", "Минеральные Воды", "Минусинск", "Михайловка", "Михайловск (Ставропольский край)", "Мичуринск", "Москва", "Мурманск", "Муром", "Мытищи", "Набережные Челны", "Назарово", "Назрань", "Нальчик", "Наро-Фоминск", "Находка", "Невинномысск", "Нерюнгри", "Нефтекамск", "Нефтеюганск", "Нижневартовск", "Нижнекамск", "Нижний Новгород", "Нижний Тагил", "Новоалтайск", "Новокузнецк", "Новокуйбышевск", "Новомосковск", "Новороссийск", "Новосибирск", "Новотроицк", "Новоуральск", "Новочебоксарск", "Новочеркасск", "Новошахтинск", "Новый Уренгой", "Ногинск", "Норильск", "Ноябрьск", "Нягань", "Обнинск", "Одинцово", "Озерск (Челябинская область)", "Октябрьский", "Омск", "Орел", "Оренбург", "Орехово-Зуево", "Орск", "Павлово", "Павловский Посад", "Пенза", "Первоуральск", "Пермь", "Петрозаводск", "Петропавловск-Камчатский", "Подольск", "Полевской", "Прокопьевск", "Прохладный", "Псков", "Пушкино", "Пятигорск", "Раменское", "Ревда", "Реутов", "Ржев", "Рославль", "Россошь", "Ростов-на-Дону", "Рубцовск", "Рыбинск", "Рязань", "Салават", "Сальск", "Самара", "Санкт-Петербург", "Саранск", "Сарапул", "Саратов", "Саров", "Свободный", "Севастополь", "Северодвинск", "Северск", "Сергиев Посад", "Серов", "Серпухов", "Сертолово", "Сибай", "Симферополь", "Славянск-на-Кубани", "Смоленск", "Соликамск", "Солнечногорск", "Сосновый Бор", "Сочи", "Ставрополь", "Старый Оскол", "Стерлитамак", "Ступино", "Сургут", "Сызрань", "Сыктывкар", "Таганрог", "Тамбов", "Тверь", "Тимашевск", "Тихвин", "Тихорецк", "Тобольск", "Тольятти", "Томск", "Троицк", "Туапсе", "Туймазы", "Тула", "Тюмень", "Узловая", "Улан-Удэ", "Ульяновск", "Урус-Мартан", "Усолье-Сибирское", "Уссурийск", "Усть-Илимск", "Уфа", "Ухта", "Феодосия", "Фрязино", "Хабаровск", "Ханты-Мансийск", "Хасавюрт", "Химки", "Чайковский", "Чапаевск", "Чебоксары", "Челябинск", "Черемхово", "Череповец", "Черкесск", "Черногорск", "Чехов", "Чистополь", "Чита", "Шадринск", "Шали", "Шахты", "Шуя", "Щекино", "Щелково", "Электросталь", "Элиста", "Энгельс", "Южно-Сахалинск", "Юрга", "Якутск", "Ялта", "Ярославль", 
"Нью-Йорк", "Дели", "Tokyo", "Апиа", "Веллингтон", "Канберра", "Маджуро", "Нгерулмуд", "Нукуалофа", "Паликир", "Порт", "Порт", "Сува", "Фунафути", "Хониара", "Южная", "Асунсьон", "Бастер", "Бельмопан", "Богота", "Бразилиа", "Бриджтаун", "Буэнос", "Вашингтон", "Гавана", "Гватемала", "Джорджтаун", "Каракас", "Кастри", "Кингстаун", "Кингстон", "Кито", "Лима", "Манагуа", "Мехико", "Монтевидео", "Нассау", "Оттава", "Панама", "Парамарибо", "Порт", "Порт", "Розо", "Сан", "Сан", "Санто", "Сантьяго", "Сент", "Сент", "Сукре", "Тегусигальпа", "Абуджа", "Аддис", "Аккра", "Алжир", "Антананариву", "Асмэра", "Бамако", "Банги", "Банжул", "Бисау", "Браззавиль", "Виктория", "Виндхук", "Габороне", "Гитега", "Дакар", "Джибути", "Джуба", "Додома", "Каир", "Кампала", "Кигали", "Киншаса", "Конакри", "Либревиль", "Лилонгве", "Ломе", "Луанда", "Лусака", "Малабо", "Мапуту", "Масеру", "Мбабане", "Могадишо", "Монровия", "Морони", "Найроби", "Нджамена", "Ниамей", "Нуакшот", "Порт", "Порто", "Прая", "Претория", "Рабат", "Сан", "Триполи", "Тунис", "Уагадугу", "Фритаун", "Хараре", "Хартум", "Ямусукро", "Яунде", "Абу", "Амман", "Анкара", "Ашхабад", "Багдад", "Баку", "Бангкок", "Бандар", "Бейрут", "Бишкек", "Вьентьян", "Дакка", "Дамаск", "Дели", "Джакарта", "Дили", "Доха", "Душанбе", "Ереван", "Иерусалим", "Исламабад", "Кабул", "Катманду", "Куала", "Мале", "Манама", "Манила", "Маскат", "Нейпьидо", "Никосия", "Нур", "Пекин", "Пномпень", "Пхеньян", "Сана", "Сеул", "Сингапур", "Ташкент", "Тбилиси", "Тегеран", "Токио", "Тхимпху", "Улан", "Ханой", "Шри", "Эль", "Эр", "Амстердам", "Андорра", "Афины", "Белград", "Берлин", "Берн", "Братислава", "Брюссель", "Будапешт", "Бухарест", "Вадуц", "Валлетта", "Варшава", "Ватикан", "Вена", "Вильнюс", "Дублин", "Загреб", "Киев", "Кишинёв", "Копенгаген", "Лиссабон", "Лондон", "Любляна", "Люксембург", "Мадрид", "Минск", "Монако", "Москва", "Осло", "Париж", "Подгорица", "Прага", "Рейкьявик", "Рига", "Рим", "Сан", "Сараево", "Скопье", "София", "Стокгольм", "Таллин", "Тирана", "Хельсинки", ];

document.addEventListener("DOMContentLoaded", ready);

function renderCities() {
    wheather_data = {};
    // for (var c in cities) {
    //     send(wheather_data, c, cities[c][0], cities[c][1]);
    // }
    lat = document.getElementById("lat");
    lon = document.getElementById("lon");
    city = document.getElementById("cities").value;
    city_data = cities[city];
    console.log(city_data);
    lat = city_data[0];
    lon = city_data[1];
    send(wheather_data, city, lat, lon, view);
}

function view(wheather_data) {
    console.log(wheather_data);
    var info = "";
    city = Object.keys(wheather_data)[0];
    info += city;
    info += "<br/>";
    info += "Температура: ";
    info += wheather_data[city]["temp"] + "°";
    info += "<br/>";
    info += "Влажность: ";
    info += wheather_data[city]["humidity"] + "%";
    info += "<br/>";
    var info_div = document.getElementById("wheather");
    info_div.innerHTML = info;
}

function send(wheather_data, city, lat, lon, f) {
    var query = 'http://127.0.0.1:5000/pogoda/'
    //var query = 'http://ksilenomen.pythonanywhere.com/pogoda/'
    query += lat;
    query += "/" + lon;
    var xhr = new XMLHttpRequest();
    xhr.open('GET', query, false);
    
    xhr.onload = function() {
        data = JSON.parse(this.responseText);
        wheather_data[city] = {
            "temp": data['fact']['temp'],
            "condition": data['fact']['condition'],
            "humidity": data['fact']['humidity'],
            "info": data['info']['url'],
        };
        if (f) f(wheather_data);
        //console.log(wheather_data);
        return data;
    }
  
    xhr.send(); 
}

function ready() {
    $("#cities").autocomplete({
          source: cities_names
    });
}
   

